SCREEN_WIDTH = 120

PyDungeonAscii = """
   ▄███████▄ ▄██   ▄   ████████▄  ███    █▄  ███▄▄▄▄      ▄██████▄     ▄████████  ▄██████▄  ███▄▄▄▄  
  ███    ███ ███   ██▄ ███   ▀███ ███    ███ ███▀▀▀██▄   ███    ███   ███    ███ ███    ███ ███▀▀▀██▄
  ███    ███ ███▄▄▄███ ███    ███ ███    ███ ███   ███   ███    █▀    ███    █▀  ███    ███ ███   ███
  ███    ███ ▀▀▀▀▀▀███ ███    ███ ███    ███ ███   ███  ▄███         ▄███▄▄▄     ███    ███ ███   ███
▀█████████▀  ▄██   ███ ███    ███ ███    ███ ███   ███ ▀▀███ ████▄  ▀▀███▀▀▀     ███    ███ ███   ███
  ███        ███   ███ ███    ███ ███    ███ ███   ███   ███    ███   ███    █▄  ███    ███ ███   ███
  ███        ███   ███ ███   ▄███ ███    ███ ███   ███   ███    ███   ███    ███ ███    ███ ███   ███
 ▄████▀       ▀█████▀  ████████▀  ████████▀   ▀█   █▀    ████████▀    ██████████  ▀██████▀   ▀█   █▀ 
 ____________________________________________________________________________________________________
 ████████████████████████████████████████████████████████████████████████████████████████████████████
"""

AttackAscii = """
░▀▄░░▀▄░░░░█▀█░▀█▀░▀█▀░█▀█░█▀▀░█░█░░░░▄▀░░▄▀
░░▄▀░░▄▀░░░█▀█░░█░░░█░░█▀█░█░░░█▀▄░░░▀▄░░▀▄░
░▀░░░▀░░░░░▀░▀░░▀░░░▀░░▀░▀░▀▀▀░▀░▀░░░░░▀░░░▀
"""
ExitAscii = """
░▀▄░░▀▄░░░░█▀▀░█░█░▀█▀░▀█▀░░░░▄▀░░▄▀
░░▄▀░░▄▀░░░█▀▀░▄▀▄░░█░░░█░░░░▀▄░░▀▄░
░▀░░░▀░░░░░▀▀▀░▀░▀░▀▀▀░░▀░░░░░░▀░░░▀
"""

def PrintAsciiCentered(ascii_art: str):
    for line in ascii_art.splitlines():
        print(line.center(SCREEN_WIDTH))

def Space(Height):
    print("\n" * Height, end="")

def LevelMessage(gameState):
    Level, Exp, ToNext = gameState["Exp"].GetLevel()
    LevelMessage : str = "Level: " + str(Level) + "." + " To next level: " + str(ToNext) + " Exp"
    print(LevelMessage.center(SCREEN_WIDTH))

def HealthDisplay(gameState):
    print(f"Health: {str(gameState["Health"].Value)}/{str(gameState["MaxHealth"].GetIncrementAmount())}".center(SCREEN_WIDTH))

def DisplayStats(gameState):
    LevelMessage(gameState)
    HealthDisplay(gameState)

def MenuButtons():
    PrintAsciiCentered(AttackAscii)
    Space(1)
    PrintAsciiCentered(ExitAscii)

def Menu(gameState):
    PrintAsciiCentered(PyDungeonAscii)
    Space(5)
    DisplayStats(gameState)
    Space(3)
    MenuButtons()

def Render(gameState):
    if gameState["CurrentState"] == "Menu":
        Menu(gameState)
    elif gameState["CurrentState"] == "AttackChoice":
        print("Attack choice")